{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      ",": 2,
      "-": 3,
      ".": 4,
      "A": 5,
      "E": 6,
      "I": 7,
      "a": 8,
      "b": 9,
      "c": 10,
      "d": 11,
      "e": 12,
      "f": 13,
      "g": 14,
      "h": 15,
      "i": 16,
      "l": 17,
      "m": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "w": 27,
      "y": 28,
      "##n": 29,
      "##t": 30,
      "##o": 31,
      "##g": 32,
      "##i": 33,
      "##e": 34,
      "##r": 35,
      "##m": 36,
      "##c": 37,
      "##a": 38,
      "##l": 39,
      "##p": 40,
      "##s": 41,
      "##y": 42,
      "##h": 43,
      "##b": 44,
      "##u": 45,
      "##d": 46,
      "##f": 47,
      "##w": 48,
      "##I": 49,
      "##v": 50,
      "##in": 51,
      "##al": 52,
      "##es": 53,
      "##pl": 54,
      "an": 55,
      "pr": 56,
      "##nt": 57,
      "##ti": 58,
      "##on": 59,
      "##cal": 60,
      "##ing": 61,
      "##ine": 62,
      "and": 63,
      "th": 64,
      "##or": 65,
      "##er": 66,
      "##ci": 67,
      "##ch": 68,
      "##cti": 69,
      "##ar": 70,
      "AI": 71,
      "ap": 72,
      "en": 73,
      "int": 74,
      "re": 75,
      "scal": 76,
      "##tw": 77,
      "##ot": 78,
      "##gine": 79,
      "##ig": 80,
      "##ent": 81,
      "##ear": 82,
      "##at": 83,
      "##ab": 84,
      "##st": 85,
      "##pli": 86,
      "the": 87,
      "##ering": 88,
      "##cipl": 89,
      "##ction": 90,
      "appli": 91,
      "##gineering": 92,
      "##abl": 93,
      "En": 94,
      "It": 95,
      "be": 96,
      "br": 97,
      "co": 98,
      "cor": 99,
      "di": 100,
      "de": 101,
      "des": 102,
      "dat": 103,
      "fu": 104,
      "ga": 105,
      "in": 106,
      "is": 107,
      "lear": 108,
      "ma": 109,
      "ro": 110,
      "res": 111,
      "so": 112,
      "sy": 113,
      "to": 114,
      "te": 115,
      "tr": 116,
      "wor": 117,
      "##ni": 118,
      "##ns": 119,
      "##ning": 120,
      "##nction": 121,
      "##oy": 122,
      "##od": 123,
      "##ges": 124,
      "##ir": 125,
      "##id": 126,
      "##iabl": 127,
      "##en": 128,
      "##em": 129,
      "##el": 130,
      "##een": 131,
      "##mm": 132,
      "##ming": 133,
      "##ment": 134,
      "##ca": 135,
      "##acti": 136,
      "##ans": 137,
      "##ld": 138,
      "##lig": 139,
      "##liabl": 140,
      "##pes": 141,
      "##scipl": 142,
      "##ypes": 143,
      "##bu": 144,
      "##uction": 145,
      "##for": 146,
      "##ftw": 147,
      "##vir": 148,
      "##incipl": 149,
      "##ploy": 150,
      "prot": 151,
      "prod": 152,
      "practi": 153,
      "principl": 154,
      "##tion": 155,
      "##onment": 156,
      "that": 157,
      "##erci": 158,
      "##chine": 159,
      "##chni": 160,
      "##are": 161,
      "engineering": 162,
      "envir": 163,
      "into": 164,
      "intel": 165,
      "real": 166,
      "reliabl": 167,
      "scale": 168,
      "scalabl": 169,
      "##tween": 170,
      "##otypes": 171,
      "##ign": 172,
      "##earch": 173,
      "##stem": 174,
      "applies": 175,
      "applica": 176,
      "Engineering": 177,
      "between": 178,
      "brid": 179,
      "comm": 180,
      "core": 181,
      "discipl": 182,
      "deploy": 183,
      "design": 184,
      "data": 185,
      "function": 186,
      "gap": 187,
      "learning": 188,
      "machine": 189,
      "robu": 190,
      "research": 191,
      "softw": 192,
      "system": 193,
      "techni": 194,
      "trans": 195,
      "world": 196,
      "##ligent": 197,
      "##forming": 198,
      "prototypes": 199,
      "production": 200,
      "practical": 201,
      "principles": 202,
      "##tions": 203,
      "##onments": 204,
      "##ercial": 205,
      "environments": 206,
      "intelligent": 207,
      "reliably": 208,
      "scalable": 209,
      "applications": 210,
      "bridges": 211,
      "commercial": 212,
      "discipline": 213,
      "functional": 214,
      "robust": 215,
      "software": 216,
      "systems": 217,
      "technical": 218,
      "transforming": 219
    }
  }
}