{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      ",": 4,
      "-": 5,
      ".": 6,
      "A": 7,
      "E": 8,
      "I": 9,
      "a": 10,
      "b": 11,
      "c": 12,
      "d": 13,
      "e": 14,
      "f": 15,
      "g": 16,
      "h": 17,
      "i": 18,
      "l": 19,
      "m": 20,
      "n": 21,
      "o": 22,
      "p": 23,
      "r": 24,
      "s": 25,
      "t": 26,
      "u": 27,
      "v": 28,
      "w": 29,
      "y": 30,
      "in": 31,
      "al": 32,
      "es": 33,
      "an": 34,
      "en": 35,
      "pl": 36,
      "cal": 37,
      "on": 38,
      "pr": 39,
      "re": 40,
      "ti": 41,
      "ine": 42,
      "ing": 43,
      "and": 44,
      "ap": 45,
      "ch": 46,
      "ci": 47,
      "cti": 48,
      "er": 49,
      "te": 50,
      "th": 51,
      "to": 52,
      "AI": 53,
      "ab": 54,
      "ar": 55,
      "at": 56,
      "co": 57,
      "ear": 58,
      "gine": 59,
      "ig": 60,
      "is": 61,
      "or": 62,
      "scal": 63,
      "tw": 64,
      "ent": 65,
      "pli": 66,
      "pro": 67,
      "appli": 68,
      "cipl": 69,
      "ction": 70,
      "ering": 71,
      "the": 72,
      "abl": 73,
      "gineering": 74,
      "En": 75,
      "It": 76,
      "are": 77,
      "ati": 78,
      "ach": 79,
      "acti": 80,
      "be": 81,
      "br": 82,
      "bu": 83,
      "cati": 84,
      "de": 85,
      "dg": 86,
      "du": 87,
      "des": 88,
      "dat": 89,
      "dis": 90,
      "een": 91,
      "fu": 92,
      "for": 93,
      "ftw": 94,
      "gap": 95,
      "ir": 96,
      "ical": 97,
      "iabl": 98,
      "idg": 99,
      "ld": 100,
      "ll": 101,
      "lear": 102,
      "liabl": 103,
      "mm": 104,
      "ms": 105,
      "ming": 106,
      "ment": 107,
      "mach": 108,
      "ning": 109,
      "nction": 110,
      "nical": 111,
      "oy": 112,
      "obu": 113,
      "oftw": 114,
      "pes": 115,
      "res": 116,
      "ran": 117,
      "robu": 118,
      "st": 119,
      "sy": 120,
      "ste": 121,
      "sfor": 122,
      "softw": 123,
      "ty": 124,
      "tran": 125,
      "vir": 126,
      "wor": 127,
      "inte": 128,
      "into": 129,
      "incipl": 130,
      "engineering": 131,
      "envir": 132,
      "ploy": 133,
      "ons": 134,
      "onment": 135,
      "practi": 136,
      "principl": 137,
      "real": 138,
      "reliabl": 139,
      "chnical": 140,
      "cial": 141,
      "ercial": 142,
      "technical": 143,
      "that": 144,
      "toty": 145,
      "core": 146,
      "comm": 147,
      "earch": 148,
      "ign": 149,
      "igent": 150,
      "scale": 151,
      "scalabl": 152,
      "tween": 153,
      "produ": 154,
      "prototy": 155,
      "applies": 156,
      "applicati": 157,
      "cipline": 158,
      "Engineering": 159,
      "between": 160,
      "bridg": 161,
      "deploy": 162,
      "design": 163,
      "data": 164,
      "discipline": 165,
      "function": 166,
      "lligent": 167,
      "learning": 168,
      "machine": 169,
      "research": 170,
      "robust": 171,
      "syste": 172,
      "sforming": 173,
      "software": 174,
      "transforming": 175,
      "world": 176,
      "intelligent": 177,
      "environment": 178,
      "practical": 179,
      "principles": 180,
      "reliably": 181,
      "commercial": 182,
      "scalable": 183,
      "production": 184,
      "prototypes": 185,
      "applications": 186,
      "bridges": 187,
      "functional": 188,
      "systems": 189,
      "environments": 190
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        "a",
        "l"
      ],
      [
        "e",
        "s"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "n"
      ],
      [
        "p",
        "l"
      ],
      [
        "c",
        "al"
      ],
      [
        "o",
        "n"
      ],
      [
        "p",
        "r"
      ],
      [
        "r",
        "e"
      ],
      [
        "t",
        "i"
      ],
      [
        "in",
        "e"
      ],
      [
        "in",
        "g"
      ],
      [
        "an",
        "d"
      ],
      [
        "a",
        "p"
      ],
      [
        "c",
        "h"
      ],
      [
        "c",
        "i"
      ],
      [
        "c",
        "ti"
      ],
      [
        "e",
        "r"
      ],
      [
        "t",
        "e"
      ],
      [
        "t",
        "h"
      ],
      [
        "t",
        "o"
      ],
      [
        "A",
        "I"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "t"
      ],
      [
        "c",
        "o"
      ],
      [
        "e",
        "ar"
      ],
      [
        "g",
        "ine"
      ],
      [
        "i",
        "g"
      ],
      [
        "i",
        "s"
      ],
      [
        "o",
        "r"
      ],
      [
        "s",
        "cal"
      ],
      [
        "t",
        "w"
      ],
      [
        "en",
        "t"
      ],
      [
        "pl",
        "i"
      ],
      [
        "pr",
        "o"
      ],
      [
        "ap",
        "pli"
      ],
      [
        "ci",
        "pl"
      ],
      [
        "cti",
        "on"
      ],
      [
        "er",
        "ing"
      ],
      [
        "th",
        "e"
      ],
      [
        "ab",
        "l"
      ],
      [
        "gine",
        "ering"
      ],
      [
        "E",
        "n"
      ],
      [
        "I",
        "t"
      ],
      [
        "a",
        "re"
      ],
      [
        "a",
        "ti"
      ],
      [
        "a",
        "ch"
      ],
      [
        "a",
        "cti"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "b",
        "u"
      ],
      [
        "c",
        "ati"
      ],
      [
        "d",
        "e"
      ],
      [
        "d",
        "g"
      ],
      [
        "d",
        "u"
      ],
      [
        "d",
        "es"
      ],
      [
        "d",
        "at"
      ],
      [
        "d",
        "is"
      ],
      [
        "e",
        "en"
      ],
      [
        "f",
        "u"
      ],
      [
        "f",
        "or"
      ],
      [
        "f",
        "tw"
      ],
      [
        "g",
        "ap"
      ],
      [
        "i",
        "r"
      ],
      [
        "i",
        "cal"
      ],
      [
        "i",
        "abl"
      ],
      [
        "i",
        "dg"
      ],
      [
        "l",
        "d"
      ],
      [
        "l",
        "l"
      ],
      [
        "l",
        "ear"
      ],
      [
        "l",
        "iabl"
      ],
      [
        "m",
        "m"
      ],
      [
        "m",
        "s"
      ],
      [
        "m",
        "ing"
      ],
      [
        "m",
        "ent"
      ],
      [
        "m",
        "ach"
      ],
      [
        "n",
        "ing"
      ],
      [
        "n",
        "ction"
      ],
      [
        "n",
        "ical"
      ],
      [
        "o",
        "y"
      ],
      [
        "o",
        "bu"
      ],
      [
        "o",
        "ftw"
      ],
      [
        "p",
        "es"
      ],
      [
        "r",
        "es"
      ],
      [
        "r",
        "an"
      ],
      [
        "r",
        "obu"
      ],
      [
        "s",
        "t"
      ],
      [
        "s",
        "y"
      ],
      [
        "s",
        "te"
      ],
      [
        "s",
        "for"
      ],
      [
        "s",
        "oftw"
      ],
      [
        "t",
        "y"
      ],
      [
        "t",
        "ran"
      ],
      [
        "v",
        "ir"
      ],
      [
        "w",
        "or"
      ],
      [
        "in",
        "te"
      ],
      [
        "in",
        "to"
      ],
      [
        "in",
        "cipl"
      ],
      [
        "en",
        "gineering"
      ],
      [
        "en",
        "vir"
      ],
      [
        "pl",
        "oy"
      ],
      [
        "on",
        "s"
      ],
      [
        "on",
        "ment"
      ],
      [
        "pr",
        "acti"
      ],
      [
        "pr",
        "incipl"
      ],
      [
        "re",
        "al"
      ],
      [
        "re",
        "liabl"
      ],
      [
        "ch",
        "nical"
      ],
      [
        "ci",
        "al"
      ],
      [
        "er",
        "cial"
      ],
      [
        "te",
        "chnical"
      ],
      [
        "th",
        "at"
      ],
      [
        "to",
        "ty"
      ],
      [
        "co",
        "re"
      ],
      [
        "co",
        "mm"
      ],
      [
        "ear",
        "ch"
      ],
      [
        "ig",
        "n"
      ],
      [
        "ig",
        "ent"
      ],
      [
        "scal",
        "e"
      ],
      [
        "scal",
        "abl"
      ],
      [
        "tw",
        "een"
      ],
      [
        "pro",
        "du"
      ],
      [
        "pro",
        "toty"
      ],
      [
        "appli",
        "es"
      ],
      [
        "appli",
        "cati"
      ],
      [
        "cipl",
        "ine"
      ],
      [
        "En",
        "gineering"
      ],
      [
        "be",
        "tween"
      ],
      [
        "br",
        "idg"
      ],
      [
        "de",
        "ploy"
      ],
      [
        "des",
        "ign"
      ],
      [
        "dat",
        "a"
      ],
      [
        "dis",
        "cipline"
      ],
      [
        "fu",
        "nction"
      ],
      [
        "ll",
        "igent"
      ],
      [
        "lear",
        "ning"
      ],
      [
        "mach",
        "ine"
      ],
      [
        "res",
        "earch"
      ],
      [
        "robu",
        "st"
      ],
      [
        "sy",
        "ste"
      ],
      [
        "sfor",
        "ming"
      ],
      [
        "softw",
        "are"
      ],
      [
        "tran",
        "sforming"
      ],
      [
        "wor",
        "ld"
      ],
      [
        "inte",
        "lligent"
      ],
      [
        "envir",
        "onment"
      ],
      [
        "practi",
        "cal"
      ],
      [
        "principl",
        "es"
      ],
      [
        "reliabl",
        "y"
      ],
      [
        "comm",
        "ercial"
      ],
      [
        "scalabl",
        "e"
      ],
      [
        "produ",
        "ction"
      ],
      [
        "prototy",
        "pes"
      ],
      [
        "applicati",
        "ons"
      ],
      [
        "bridg",
        "es"
      ],
      [
        "function",
        "al"
      ],
      [
        "syste",
        "ms"
      ],
      [
        "environment",
        "s"
      ]
    ]
  }
}